Revit 2026 API

# UIControlledApplicationFormulaEditing Event

---

Subscribe to the FormulaEditing event

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
```
```vb
Public Event FormulaEditing As EventHandler(Of FormulaEditingEventArgs)
```
```cpp
public:
 event EventHandler<FormulaEditingEventArgs^>^ FormulaEditing {
	void add (EventHandler<FormulaEditingEventArgs^>^ value);
	void remove (EventHandler<FormulaEditingEventArgs^>^ value);
}
```
```fsharp
member FormulaEditing : IEvent<EventHandler<FormulaEditingEventArgs>,
    FormulaEditingEventArgs>
```

#### Value

EventHandlerFormulaEditingEventArgs

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace